/**/
"Cancel" = "キャンセル";
/**/
"Delete" = "削除";
/**/
"Open" = "開く";
/**/
"Edit" = "編集";
/**/
"Yes" = "はい";
/**/
"Finish" = "完了";
/**/
"Done" = "終了";
/**/
"Save" = "保存";
/**/
"Undo" = "元に戻す";
/**/
"Redo" = "やり直し";
/**/
"OK" = "OK";
/**/
"Yes Delete" = "はい。削除します。";


/*Geometry Edit Action Name*/
"Apply Geometry" = "ジオメトリの適用";
/*Geometry Edit Action Name*/
"Clear Geometry" = "ジオメトリの消去";
/*Geometry Edit Action Name*/
"Delete Vertex" = "頂点の削除";
/*Geometry Edit Action Name*/
"Insert Part" = "パートの挿入";
/*Geometry Edit Action Name*/
"Insert Vertex" = "頂点の挿入";
/*Geometry Edit Action Name*/
"Move Vertex" = "頂点の移動";
/*Geometry Edit Action Name*/
"Remove Part" = "パートの削除";

/*Collecting attachments*/
"Add" = "追加";
/*Collecting attachments*/
"Take Photo or Video" = "写真またはビデオの撮影";
/*Collecting attachments*/
"Choose From Library" = "ライブラリから選択";
/*Collecting attachments*/
"Photo" = "写真";
/*Collecting attachments*/
"Video" = "ビデオ";
/*Collecting attachments*/
"Save To Photo Library" = "フォトライブラリに保存";
/*Collecting attachments*/
"Download" = "ダウンロード";

/*Date attribute*/
"Today" = "今日";

/**/
"Attachments" = "添付ファイル";
"Attributes" = "属性";

/**/
"Open in Safari" = "Safari で開く";

/* Please enter a numeric value between 0 and 5.*/
"Enter a number between %i and %i." = "%i から %i の間で数値を入力";

/* Please enter a numeric value between 0.5 and 5.0.*/
"Enter a number between %@ and %@." = "%@ から %@ の間で数値を入力";

/* string length error, when user enters too many characters in string attribute editor:
  Too many characters.  Current: 512.  Allowed: 256 */
"Too many characters (%@)" = "文字数が多すぎます (%@)";

/* When a number is entered outside the range */
"Number is outside the acceptable range." = "数値が許容範囲外です。";

/* BLOB, RASTER, etc */
"Field type not supported" = "サポートされていないフィールド型";

/**/
"%d of %d" = "%d / %d";

/**/
"Changing Feature Type" = "フィーチャ タイプの変更";
"You are changing the feature type, which may potentially overwrite some field values. Are you sure you want to do this?" =  "このフィーチャ タイプの変更により、一部のフィールド値が上書きされる可能性があります。続行しますか？";

/**/
"Deleting Feature" = "フィーチャの削除";
"Are you sure you want to delete this feature?" = "このフィーチャを削除してもよろしいですか？";

/**/
"Data for pie chart is invalid" = "円グラフのデータが無効です";
"No data to create a pie chart" = "円グラフを作成するためのデータがありません";
"No image to display" = "表示する画像がありません";

/**/
"Created by %@ seconds ago" = "%@ が数秒前に作成";

/**/
"Created by %@ a minute ago" = "%@ が 1 分前に作成";

/**/
"Edited by %@ seconds ago" = "%@ が数秒前に編集";

/**/
"Edited by %@ a minute ago" = "%@ が 1 分前に編集";

/**/
"Created seconds ago" = "数秒前に作成";

/**/
"Created a minute ago" = "1 分前に作成";

/**/
"Edited seconds ago" = "数秒前に編集";

/**/
"Edited a minute ago" = "1 分前に編集";

/**/
"Created by %@ %d minutes ago" = "%@ が %d 分前に作成";

/**/
"Created by %@ an hour ago" = "%@ が 1 時間前に作成";

/**/
"Created by %@ %d hours ago" = "%@ が %d 時間前に作成";

/*"Created by %@ on ${weekDay} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - day" = "%@ が %@ の %@ に作成";

/*"Created by %@ on ${formattedDate} at ${formattedTime}"*/
"Created by %@ on %@ at %@ - full" = "%@ が %@ の %@ に作成";

/**/
"Edited by %@ %d minutes ago" = "%@ が %d 分前に編集";

/**/
"Edited by %@ an hour ago" = "%@ が 1 時間前に編集";

/**/
"Edited by %@ %d hours ago" = "%@ が %d 時間前に編集";

/**/
"Edited by %@ on %@ at %@ - day" = "%@ が %@ の %@ に編集";

/**/
"Edited by %@ on %@ at %@ - full" = "%@ が %@ の %@ に編集";

/**/
"Created by %@" = "%@ が作成";

/**/
"Edited by %@" = "%@ が編集";

/**/
"Created %d minutes ago" = "%d 分前に作成";

/**/
"Created an hour ago" = "1 時間前に作成";

/**/
"Created %d hours ago" = "%d 時間前に作成";

/*"Created on ${weekDay} at ${formattedTime}"*/
"Created on %@ at %@ - day" = "%@ の %@ に作成";

/*"Created on ${formattedDate} at ${formattedTime}"*/
"Created on %@ at %@ - full" = "%@ の %@ に作成";

/**/
"Edited %d minutes ago" = "%d 分前に編集";

/**/
"Edited an hour ago" = "1 時間前に編集";

/**/
"Edited %d hours ago" = "%d 時間前に編集";

/*"Edited on ${weekDay} at ${formattedTime}"*/
"Edited on %@ at %@ - day" = "%@ の %@ に編集";

/*"Edited on ${formattedDate} at ${formattedTime}"*/
"Edited on %@ at %@ - full" = "%@ の %@ に編集";

/* Used to denote a required field */
"Required" = "要求";

/* Used for naming layers with no names */
"Layer %d" = "レイヤ %d";

/* Geocoding: returned when locator cannot find address for given location */
"Cannot find address for location" = "位置に対応する住所が見つかりません";

/* Geocoding: returned when locator cannot find location for given address */
"Cannot find location for address" = "住所に対応する位置が見つかりません";

/* Geocoding: core: used when address cannot be read */
"Cannot read address" = "住所を読み取れません";

/* Geocoding: core: used when one of the locator files cannot be found */
"File not found" = "ファイルが見つかりません";

/* Geocoding: core: returned when locator cannot be loaded */
"Cannot load locator" = "ロケータを読み込めません";

/* Geocoding: core: returned when some internal engine error occurs */
"Locator internal error" = "ロケータ内部エラー";

/* Geocoding: core: used when client tried to geocode intersections while locator does not support it */
"Intersections geocoding is not supported by locator" = "交点のジオコーディングはロケータでサポートされていません";

/* Geocoding: core: returned when some locator property is not valid */
"Invalid locator properties" = "ロケータのプロパティが無効です";

/* Geocoding: core: used when client did not set required field for address geocoding */
"Required field is missing" = "必須フィールドが入力されていません";

/* Geocoding: core: used when operation is performed over uninitialized locator */
"Locator is not initialized" = "ロケータが初期化されていません";

/* Geocoding: core: returned when locator format is not supported */
"Unsupported locator format" = "ロケータの形式がサポートされていません";

/* Geocoding: core: returned when geocoding engine cannot make projection transformation */
"Unsupported projection transformation" = "投影変換がサポートされていません";

/* Geocoding: core: used when given spatial reference is not supported */
"Unsupported spatial reference" = "空間参照がサポートされていません";

/*Geocoding: core: used when locator being used does not support reverse geocoding */
"Reverse geocoding not supported with this locator." = "このロケータでは、リバース ジオコーディングはサポートされていません。";

/* Network analyst errors */
"Cannot open network." = "ネットワーク データを開けません。";
"Cannot retrieve route task parameters." = "ルート タスク パラメータを取得できません。";
"Insufficient number of stops." = "ストップ数が足りません。";
"Stop (%@) was not located." = "ストップ (%@) が指定されていません。";
"Stop (%@) is located on a non traversable element." = "ストップ (%@) が、通過できない位置にあります。";
"Stop (%@) is located on a soft restricted element." = "ストップ (%@) が、軽い規制を受けている位置にあります。";
"Point barrer (%@) was not located." = "ポイント バリア (%@) が指定されていません。";
"Point barrier (%@) has invalid added cost attribute name." = "ポイント バリア (%@) の追加コスト属性名が無効です。";
"Line barrier (%@) has invalid scaled cost attribute name." = "ライン バリア (%@) のコスト係数指定属性名が無効です。";
"Line barrier (%@) does not cover any network elements." = "ライン バリア (%@) はどのネットワーク エレメントもカバーしていません。";
"Polygon barrier (%@) has invalid scaled cost attribute name." = "ポリゴン バリア (%@) のコスト係数指定属性名が無効です。";
"Polygon barrier (%@) does not cover any network elements." = "ポリゴン バリア (%@) はどのネットワーク エレメントもカバーしていません。";
"'%@' is an invalid impedance attribute." = "'%@' は無効なインピーダンス属性です。";
"'%@' restriction attribute is invalid." = "'%@' 規制属性が無効です。";
"'%@' accumulate attribute is invalid." = "'%@' 累積属性が無効です。";
"'%@' is an invalid directions time attribute." = "'%@' は無効なルート案内時間属性です。";
"Directions distance attribute is invalid." = "ルート案内距離属性が無効です。";
"Invalid attribute parameter attribute name (%@)." = "属性パラメータの属性名 (%@) が無効です。";
"Invalid attribute parameter parameter name (%@)." = "属性パラメータのパラメータ名 (%@) が無効です。";
"Invalid value type for attribute (%1$@) parameter (%2$@)." = "属性 (%1$@) パラメータ (%2$@) の値のタイプが無効です。";
"Invalid restriction usage value for attribute (%1$@) parameter (%2$@)." = "属性 (%1$@) パラメータ (%2$@) の規制使用の値が無効です。";
"Neutral restriction usage value for attribute (%1$@) parameter (%2$@)." = "属性 (%1$@) パラメータ (%2$@) の規制使用の値が中立的です。";
"Soft restricted element (%@) was traversed." = "軽い規制を受けている位置 (%@) を通過しました。";
"The network does not have a hierarchy attribute for performing hierarchical route planning." = "階層的ルート計画を実行するための階層属性がネットワークにありません。";
"No path can be found between a given pair of stops (%@)." = "指定されたストップ (%@) 間のパスが見つかりません。";
"The input spatial reference is undefined." = "入力空間参照が未定義です。";
"The output spatial reference is undefined." = "出力空間参照が未定義です。";
"The directions style is invalid." = "ルート案内のスタイルが無効です。";
"The directions language is invalid." = "ルート案内の言語が無効です。";
"Directions time and distance attributes do not match." = "ルート案内時間属性と距離属性が適合していません。";
"The directions road class attribute is invalid." = "ルート案内道路クラス属性が無効です。";
"Unknown condition." = "不明な条件";
"Invalid route task parameters." = "ルート タスク パラメータが無効です。";
"Route task's solution cannot be found." = "ルート タスクのソリューションが見つかりません。";
"Route task was cancelled." = "ルート タスクがキャンセルされました。";
"Route task internal error." = "ルート タスク内部エラー";
"Route name property is not supported for local route task." = "ルート名プロパティがローカル ルート タスクでサポートされていません。";
"Local route task parameters should be retrieved from route task." = "ローカル ルート タスク パラメータはルート タスクから取得される必要があります。";
"Cannot retrieve network description." = "ネットワークの説明を取得できません。";
"Only one length attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "impedanceAttributeName と accumulateAttributeNames に指定できる長さ属性は 1 つだけです。";
"Only one time attribute can be specified for impedanceAttributeName and accumulateAttributeNames." = "impedanceAttributeName と accumulateAttributeNames に指定できる時間属性は 1 つだけです。";
"Service not supported." = "サポートされていないサービスです。";
"Specified start time occurs before January 1, 1970." = "指定した時間が 1970 年 1 月 1 日より前になっています。";
"Stop (%@) has a start time that occurs before January 1, 1970." = "Stop (%@) の開始時間が 1970 年 1 月 1 日より前になっています。";
"Stop (%@) has a local time window that starts before January 1, 1970." = "ストップ (%@) に、1970 年 1 月 1 日より前に開始するローカル タイム ウィンドウがあります。";
"Stop (%@) has a UTC time window that starts before January 1, 1970." = "Stop (%@) に、1970 年 1 月 1 日より前に開始する UTC タイム ウィンドウがあります。";
"Stop (%@) has a time window end that occurs before its time window start." = "Stop (%@) のタイム ウィンドウ終了値が、そのタイム ウィンドウの開始より前の値になっています。";

/* Unit Abbreviated strings */
"cm" = "cm";
"dd" = "dd";
"dm" = "dm";
"ft" = "ft";
"in" = "in";
"km" = "km";
"m" = "m";
"mi" = "mi";
"mm" = "mm";
"nm" = "nm";
"pt" = "pt";
"Unknown" = "不明";
"yd" = "yd";

/* Unit Display Strings */
"Centimeters" = "センチメートル";
"Decimal Degrees" = "度 (10進)";
"Decimeters" = "デシメートル";
"Feet" = "フィート";
"Inches" = "インチ";
"Kilometers" = "キロメートル";
"Meters" = "メートル";
"Miles" = "マイル";
"Millimeters" = "ミリメートル";
"Nautical Miles" = "海里";
"Points" = "ポイント";
"Yards" = "ヤード";

/* Area Units Abbreviated Strings */
"sq. in" = "sq. in";
"sq. ft" = "sq. ft";
"sq. yd" = "sq. yd";
"ac" = "ac";
"sq. mi" = "sq. mi";
"sq. mm" = "sq. mm";
"sq. cm" = "sq. cm";
"sq. dm" = "sq. dm";
"sq. m" = "sq. m";
"ares" = "ares";
"ha" = "ha";
"sq. km" = "sq. km";

/* Area Units Display Strings */
"Square Inches" = "平方インチ";
"Square Feet" = "平方フィート";
"Square Yards" = "平方ヤード";
"Acres" = "エーカー";
"Square Miles" = "平方マイル";
"Square Millimeters" = "平方ミリメートル";
"Square Centimeters" = "平方センチメートル";
"Square Decimeters" = "平方デシメートル";
"Square Meters" = "平方メートル";
"Ares" = "アール";
"Hectares" = "ヘクタール";
"Square Kilometers" = "平方キロメートル";

/* Errors */
"Error" = "エラー";
"Class not @protocol AGSCoding compliant" = "クラスが @protocol AGSCoding に準拠していません";
"Authorization required" = "認証が必要です";
"Token is invalid or has expired" = "トークンが無効か期限が切れています";
"Unknown error occurred" = "原因不明のエラーが発生しました";
"Empty username/password" = "ユーザ名/パスワードが入力されていません";
"Token URL is nil. You must set a valid token URL on the credential." = "トークン URL が Nil です。資格情報に有効なトークン URL を設定する必要があります。";
"Unknown authentication error" = "原因不明の認証エラーが発生しました";
"Error extracting identity" = "ID を抽出中にエラーが発生しました";
"Error adding identity to the keychain" = "ID をキーチェーンに追加中にエラーが発生しました";
"Invalid Credentials" = "無効な資格情報";
"Bad URL." = "不正な URL です。";
"The feature layer does not expose an object-id field." = "フィーチャ レイヤがオブジェクト ID フィールドを表示していません。";
"Both geodatabase and syncParams are required for this method." = "この方法では、ジオデータベースと syncParams の両方が必要です。";
"Uploading deltas is not supported with this replica." = "同期が有効化されたこのジオデータベースでは差分のアップロードはサポートされていません。";
"Error creating delta geodatabase" = "差分ジオデータベースを作成中にエラーが発生しました";
"Unable to create result image layer" = "結果のイメージ レイヤを作成できません";
"Cache at path '%@' not found." = "パス '%@' にキャッシュが見つかりません。";
"To add an item, you must be logged in to the portal." = "アイテムを追加するには、ポータルにログインしている必要があります。";
"To add an item, you must specify a value in the AGSPortalItemContentParameters." = "アイテムを追加するには、AGSPortalItemContentParameters に値を指定する必要があります。";
"The portal failed to add the item." = "ポータルにアイテムを追加できませんでした。";
"To delete an item, you must be logged in to the portal." = "アイテムを削除するには、ポータルにログインしている必要があります。";
"The portal failed to delete the item." = "ポータルのアイテムを削除できませんでした。";
"To update an item, an itemId and logged in user are required." = "アイテムをアップデートするには、アイテム ID とログイン ユーザが必要です。";
"The item failed to update." = "アイテムはアップデートできませんでした。";
"The item failed to update JSON." = "アイテムは、JSON をアップデートできませんでした。";
"You must be logged in to a portal to add a comment." = "ポータルにログインしてコメントを追加する必要があります。";
"The comment failed to be added." = "コメントを追加できませんでした。";
"You must be logged in to a portal to fetch the current user's rating." = "ポータルにログインして、現在の評価を取得する必要があります。";
"You must be logged in to a portal to add a rating." = "ポータルにログインして、評価を追加する必要があります。";
"The rating failed to be added." = "評価を追加できませんでした。";
"To share an item, you must be logged in to the portal." = "アイテムを共有するには、ポータルにログインしている必要があります。";
"To unshare an item, you must be logged in to the portal and specify groups with which to unshare the item." = "アイテムの共有を解除するには、ポータルにログインして、アイテムの共有を解除するグループを指定する必要があります。";
"Bad Request" = "不正な要求";
"Credential Required" = "AGSCredential が必要です";
"Job not created" = "ジョブが作成されていません";
"Service did not return a valid URL" = "サービスは有効な URL を返しませんでした";
"Service did not return a file" = "サービスはファイルを返しませんでした";
"Service did not return a size" = "サービスはサイズを返しませんでした";
"Job failed" = "ジョブが失敗しました";
"Job timed out" = "ジョブがタイム アウト しました";
"Job was cancelled" = "ジョブはキャンセルされました";
"Job was deleted" = "ジョブは削除されました";
"Feature with objectId: %d not found" = "objectId: %d のフィーチャが見つかりません";
"No object-id values specified for feature table query." = "フィーチャ テーブルのクエリにオブジェクト ID の値が指定されていません。";
"Geodatbase at path '%@' not found." = "パス '%@' にジオデータベースが見つかりません。";
"An error occured when creating the local Geodatabase" = "ローカル ジオデータベースを作成中にエラーが発生しました。";
"Operation not supported for Geodatabase Feature Service Table" = "ジオデータベース フィーチャ サービス テーブルではサポートされていない操作です。";

/* OAuth */
"The specified clientID is invalid" = "指定された clientID は無効です";
"Log In" = "ログイン";

/* Sync */
"Upload is not supported with this service." = "このサービスでは、アップロードはサポートされていません。";
"In order to call sync, a sync direction other than AGSGDBSyncDirectionNone must be specified." = "同期を呼び出すには、AGSGDBSyncDirectionNone 以外の同期方向を指定する必要があります。";